// Array 객체 다 써보기

let stringArray = [
  "안녕",
  "반가워",
  "내",
  "이름은",
  "한덕용",
  "이야.",
  "이건 공백이 있는 요소",
  "이건공백이없는요소",
  "이건,틀,딱체",
];

let numberArray = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

let oneArr = ["나는 혼자다."];

// -------------------------------------------------------------------------------------

// console.log(stringArray);

// -------------------------------------------------------------------------------------

// concat() : 배열끼리 합치기

// console.log(stringArray.concat(numberArray));

// 기존 배열 뒤에 들어가게 됨.
// console.log(numberArray.concat(stringArray));

// -------------------------------------------------------------------------------------

// every() : 배열의 모든 요소가 제공된 함수로 구현된 테스트를 통과하는지 테스트함. 불리언 값 반환

// let trueDubi = (arr) => arr < 11;
// let falseDubi = (arr) => arr > 11;
// console.log(numberArray.every(trueDubi));
// console.log(numberArray.every(falseDubi));

// -------------------------------------------------------------------------------------

// forEach() : 각 배열 요소에 대해 제공된 함수를 한 번씩 실행

// stringArray.forEach((e) => console.log(e));

// stringArray.forEach((e) => {
//   console.log(e.split(""));
//   console.log(e.length);
// });

// -------------------------------------------------------------------------------------

// indexOf() : 배열에서 주어진 요소를 찾을 수 있는 첫 번째 인덱스를 반환. 찾을 수 없는 경우 -1

// console.log(stringArray.indexOf("한덕용"));
// console.log(numberArray.indexOf(11));
// console.log(numberArray.indexOf(1));
// console.log(numberArray.indexOf("1")); // 문자열이라 탈락

// -------------------------------------------------------------------------------------

// includes() : 배열의 항목에 특정 값이 포함되어 있는지를 판단하여 적절히 true 또는 false 반환

// console.log(numberArray.includes(2));
// console.log(stringArray.includes("한덕용"));
// console.log(stringArray.includes("덕용"));

// -------------------------------------------------------------------------------------

// join() : 배열 요소를 문자열로 합침. 구분자 지정 가능
// 항목이 하나만 있는 경우 구분기호를 사용하지 않고 반환

// console.log(stringArray.join());
// console.log(stringArray.join(""));
// console.log(stringArray.join("!"));
// console.log(oneArr.join("!dasdasd")); // 그냥 뱉어냄

// -------------------------------------------------------------------------------------

// push() : 배열 끝에 요소 추가 후 배열의 새로운 길이 반환
// let push1 = numberArray.push(12, 13);

// console.log(push1); // 새로운 길이 반환

// console.log(numberArray);

// -------------------------------------------------------------------------------------

// unshift() : 배열의 시작 부분에 새로운 요소 추가 후 새로운 길이 반환



// -------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------

// -------------------------------------------------------------------------------------

// reduce, filter, map 같이 정리해놓고 무조건 공부

